zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS0_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS0_CLK_DIV_OFF (0u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS1_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS1_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS1_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS1_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS1_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS1_CLK_DIV_OFF (2u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS2_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS2_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS2_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS2_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS2_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS2_CLK_DIV_OFF (4u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS3_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS3_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS3_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS3_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS3_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS3_CLK_DIV_OFF (6u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS4_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS4_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS4_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS4_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS4_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS4_CLK_DIV_OFF (8u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS5_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS5_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS5_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS5_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS5_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS5_CLK_DIV_OFF (10u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS6_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS6_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS6_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS6_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS6_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS6_CLK_DIV_OFF (12u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS7_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS7_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS7_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS7_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS7_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS7_CLK_DIV_OFF (14u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS8_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS8_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS8_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS8_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS8_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS8_CLK_DIV_OFF (16u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS9_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS9_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS9_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS9_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS9_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS9_CLK_DIV_OFF (18u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS10_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS10_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS10_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS10_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS10_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS10_CLK_DIV_OFF (20u)

/** \brief Length for Ifx_GTM_CLS_CLK_CFG_Bits.CLS11_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS11_CLK_DIV_LEN (2u)

/** \brief Mask for Ifx_GTM_CLS_CLK_CFG_Bits.CLS11_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS11_CLK_DIV_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CLS_CLK_CFG_Bits.CLS11_CLK_DIV */
#define IFX_GTM_CLS_CLK_CFG_CLS11_CLK_DIV_OFF (22u)

/** \brief Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_LEN (2u)

/** \brief Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_LEN (2u)

/** \brief Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_OFF (2u)

/** \brief Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_LEN (2u)

/** \brief Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_OFF (4u)

/** \brief Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH3 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH3_LEN (2u)

/** \brief Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH3 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH3 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH3_OFF (6u)

/** \brief Length for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_LEN (1u)

/** \brief Mask for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_LEN (3u)

/** \brief Mask for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_MSK (0x7u)

/** \brief Offset for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_OFF (1u)

/** \brief Length for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_LEN (27u)

/** \brief Mask for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_MSK (0x7ffffffu)

/** \brief Offset for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_LEN (1u)

/** \brief Mask for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_LEN (3u)

/** \brief Mask for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_MSK (0x7u)

/** \brief Offset for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_OFF (1u)

