zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_CDTI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_CDTI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_CDTI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_CDTI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_CDTI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_CDTI_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_CDSI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_CDSI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_CDSI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_CDSI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_CDSI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_CDSI_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TORI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TORI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TORI_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_SORI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_SORI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_SORI_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH6_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM0_CH7_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH0_IRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH1_IRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH2_IRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH3_IRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH4_IRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R2_Bits.TIM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R2_TIM1_CH5_IRQ_MSK (0x1u)

