zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH1_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH2_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH3_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM6_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM6_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH0_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH1_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH2_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH3_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH4_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH5_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH6_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R3_Bits.TIM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R3_TIM7_CH7_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS0_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS0_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS0_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS0_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS0_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS0_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R4_Bits.MCS0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS0_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R4_Bits.MCS0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS0_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R4_Bits.MCS0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R4_MCS0_CH2_IRQ_OFF (2u)

