zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH6_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM7_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM7_CH7_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH6_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM8_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM8_CH7_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH0_IRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH1_IRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH2_IRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH3_IRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH4_IRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH5_IRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH6_IRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH7_IRQ_MSK (0x1u)

