zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM9_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM9_CH7_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH0_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH1_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH2_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH3_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM10_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM10_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH0_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH1_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH2_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH3_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH4_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH5_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH6_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R11_Bits.ATOM11_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R11_ATOM11_CH7_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_OFF (0u)

