zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS5_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS5_CH5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS5_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS5_CH5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS5_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS5_CH5_EIRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS5_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS5_CH6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS5_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS5_CH6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS5_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS5_CH6_EIRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS5_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS5_CH7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS5_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS5_CH7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS5_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS5_CH7_EIRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH0_EIRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH1_EIRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH2_EIRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH3_EIRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH4_EIRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH5_EIRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH6_EIRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS6_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS6_CH7_EIRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH0_EIRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH1_EIRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH2_EIRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH3_EIRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH4_EIRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH5_EIRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI4_Bits.MCS7_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI4_MCS7_CH6_EIRQ_LEN (1u)

