zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M2_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M2_CH7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M2_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M2_CH7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_PSM_Bits.PSM_M2_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_PSM_PSM_M2_CH7_EIRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE0_EIRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE1_EIRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE2_EIRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE3_EIRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE4_EIRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI_SPE_Bits.SPE5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI_SPE_SPE5_EIRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M0_EIRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M0_EIRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M0_EIRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.FIFO_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_FIFO_M0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.FIFO_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_FIFO_M0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.FIFO_M0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_FIFO_M0_EIRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M1_EIRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M1_EIRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M1_EIRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.FIFO_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_FIFO_M1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.FIFO_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_FIFO_M1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.FIFO_M1_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_FIFO_M1_EIRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.TIM_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_TIM_M2_EIRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.MCS_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_MCS_M2_EIRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.SPE_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_SPE_M2_EIRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_MEI_CLS_Bits.FIFO_M2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_CLS_FIFO_M2_EIRQ_LEN (1u)

