zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN11 */
#define IFX_GTM_DPLL_CTRL_3_AEN11_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN11 */
#define IFX_GTM_DPLL_CTRL_3_AEN11_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN11 */
#define IFX_GTM_DPLL_CTRL_3_AEN11_OFF (11u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN12 */
#define IFX_GTM_DPLL_CTRL_3_AEN12_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN12 */
#define IFX_GTM_DPLL_CTRL_3_AEN12_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN12 */
#define IFX_GTM_DPLL_CTRL_3_AEN12_OFF (12u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN13 */
#define IFX_GTM_DPLL_CTRL_3_AEN13_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN13 */
#define IFX_GTM_DPLL_CTRL_3_AEN13_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN13 */
#define IFX_GTM_DPLL_CTRL_3_AEN13_OFF (13u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN14 */
#define IFX_GTM_DPLL_CTRL_3_AEN14_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN14 */
#define IFX_GTM_DPLL_CTRL_3_AEN14_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN14 */
#define IFX_GTM_DPLL_CTRL_3_AEN14_OFF (14u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN15 */
#define IFX_GTM_DPLL_CTRL_3_AEN15_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN15 */
#define IFX_GTM_DPLL_CTRL_3_AEN15_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN15 */
#define IFX_GTM_DPLL_CTRL_3_AEN15_OFF (15u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD8 */
#define IFX_GTM_DPLL_CTRL_3_WAD8_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD8 */
#define IFX_GTM_DPLL_CTRL_3_WAD8_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD8 */
#define IFX_GTM_DPLL_CTRL_3_WAD8_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD9 */
#define IFX_GTM_DPLL_CTRL_3_WAD9_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD9 */
#define IFX_GTM_DPLL_CTRL_3_WAD9_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD9 */
#define IFX_GTM_DPLL_CTRL_3_WAD9_OFF (17u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD10 */
#define IFX_GTM_DPLL_CTRL_3_WAD10_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD10 */
#define IFX_GTM_DPLL_CTRL_3_WAD10_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD10 */
#define IFX_GTM_DPLL_CTRL_3_WAD10_OFF (18u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD11 */
#define IFX_GTM_DPLL_CTRL_3_WAD11_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD11 */
#define IFX_GTM_DPLL_CTRL_3_WAD11_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD11 */
#define IFX_GTM_DPLL_CTRL_3_WAD11_OFF (19u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD12 */
#define IFX_GTM_DPLL_CTRL_3_WAD12_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD12 */
#define IFX_GTM_DPLL_CTRL_3_WAD12_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD12 */
#define IFX_GTM_DPLL_CTRL_3_WAD12_OFF (20u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD13 */
#define IFX_GTM_DPLL_CTRL_3_WAD13_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD13 */
#define IFX_GTM_DPLL_CTRL_3_WAD13_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD13 */
#define IFX_GTM_DPLL_CTRL_3_WAD13_OFF (21u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD14 */
#define IFX_GTM_DPLL_CTRL_3_WAD14_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD14 */
#define IFX_GTM_DPLL_CTRL_3_WAD14_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD14 */
#define IFX_GTM_DPLL_CTRL_3_WAD14_OFF (22u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD15 */
#define IFX_GTM_DPLL_CTRL_3_WAD15_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD15 */
#define IFX_GTM_DPLL_CTRL_3_WAD15_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD15 */
#define IFX_GTM_DPLL_CTRL_3_WAD15_OFF (23u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_4_Bits.AEN16 */
#define IFX_GTM_DPLL_CTRL_4_AEN16_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_4_Bits.AEN16 */
#define IFX_GTM_DPLL_CTRL_4_AEN16_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_4_Bits.AEN16 */
#define IFX_GTM_DPLL_CTRL_4_AEN16_OFF (8u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_4_Bits.AEN17 */
#define IFX_GTM_DPLL_CTRL_4_AEN17_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_4_Bits.AEN17 */
#define IFX_GTM_DPLL_CTRL_4_AEN17_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_4_Bits.AEN17 */
#define IFX_GTM_DPLL_CTRL_4_AEN17_OFF (9u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_4_Bits.AEN18 */
#define IFX_GTM_DPLL_CTRL_4_AEN18_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_4_Bits.AEN18 */
#define IFX_GTM_DPLL_CTRL_4_AEN18_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_4_Bits.AEN18 */
#define IFX_GTM_DPLL_CTRL_4_AEN18_OFF (10u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_4_Bits.AEN19 */
#define IFX_GTM_DPLL_CTRL_4_AEN19_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_4_Bits.AEN19 */
#define IFX_GTM_DPLL_CTRL_4_AEN19_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_4_Bits.AEN19 */
#define IFX_GTM_DPLL_CTRL_4_AEN19_OFF (11u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_4_Bits.AEN20 */
#define IFX_GTM_DPLL_CTRL_4_AEN20_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_4_Bits.AEN20 */
#define IFX_GTM_DPLL_CTRL_4_AEN20_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_4_Bits.AEN20 */
#define IFX_GTM_DPLL_CTRL_4_AEN20_OFF (12u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_4_Bits.AEN21 */
#define IFX_GTM_DPLL_CTRL_4_AEN21_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_4_Bits.AEN21 */
#define IFX_GTM_DPLL_CTRL_4_AEN21_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_4_Bits.AEN21 */
#define IFX_GTM_DPLL_CTRL_4_AEN21_OFF (13u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_4_Bits.AEN22 */
#define IFX_GTM_DPLL_CTRL_4_AEN22_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_4_Bits.AEN22 */
#define IFX_GTM_DPLL_CTRL_4_AEN22_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_4_Bits.AEN22 */
#define IFX_GTM_DPLL_CTRL_4_AEN22_OFF (14u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_4_Bits.AEN23 */
#define IFX_GTM_DPLL_CTRL_4_AEN23_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_4_Bits.AEN23 */
#define IFX_GTM_DPLL_CTRL_4_AEN23_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_4_Bits.AEN23 */
#define IFX_GTM_DPLL_CTRL_4_AEN23_OFF (15u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_4_Bits.WAD16 */
#define IFX_GTM_DPLL_CTRL_4_WAD16_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_4_Bits.WAD16 */
#define IFX_GTM_DPLL_CTRL_4_WAD16_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_CTRL_4_Bits.WAD16 */
#define IFX_GTM_DPLL_CTRL_4_WAD16_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_CTRL_4_Bits.WAD17 */
#define IFX_GTM_DPLL_CTRL_4_WAD17_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_CTRL_4_Bits.WAD17 */
#define IFX_GTM_DPLL_CTRL_4_WAD17_MSK (0x1u)

