zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG6 */
#define IFX_GTM_TRIGOUT_TRIG6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG6 */
#define IFX_GTM_TRIGOUT_TRIG6_OFF (12u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG7 */
#define IFX_GTM_TRIGOUT_TRIG7_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG7 */
#define IFX_GTM_TRIGOUT_TRIG7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG7 */
#define IFX_GTM_TRIGOUT_TRIG7_OFF (14u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG8 */
#define IFX_GTM_TRIGOUT_TRIG8_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG8 */
#define IFX_GTM_TRIGOUT_TRIG8_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG8 */
#define IFX_GTM_TRIGOUT_TRIG8_OFF (16u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG9 */
#define IFX_GTM_TRIGOUT_TRIG9_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG9 */
#define IFX_GTM_TRIGOUT_TRIG9_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG9 */
#define IFX_GTM_TRIGOUT_TRIG9_OFF (18u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG10 */
#define IFX_GTM_TRIGOUT_TRIG10_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG10 */
#define IFX_GTM_TRIGOUT_TRIG10_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG10 */
#define IFX_GTM_TRIGOUT_TRIG10_OFF (20u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG11 */
#define IFX_GTM_TRIGOUT_TRIG11_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG11 */
#define IFX_GTM_TRIGOUT_TRIG11_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG11 */
#define IFX_GTM_TRIGOUT_TRIG11_OFF (22u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG12 */
#define IFX_GTM_TRIGOUT_TRIG12_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG12 */
#define IFX_GTM_TRIGOUT_TRIG12_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG12 */
#define IFX_GTM_TRIGOUT_TRIG12_OFF (24u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG13 */
#define IFX_GTM_TRIGOUT_TRIG13_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG13 */
#define IFX_GTM_TRIGOUT_TRIG13_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG13 */
#define IFX_GTM_TRIGOUT_TRIG13_OFF (26u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG14 */
#define IFX_GTM_TRIGOUT_TRIG14_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG14 */
#define IFX_GTM_TRIGOUT_TRIG14_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG14 */
#define IFX_GTM_TRIGOUT_TRIG14_OFF (28u)

/** \brief Length for Ifx_GTM_TRIGOUT_Bits.TRIG15 */
#define IFX_GTM_TRIGOUT_TRIG15_LEN (2u)

/** \brief Mask for Ifx_GTM_TRIGOUT_Bits.TRIG15 */
#define IFX_GTM_TRIGOUT_TRIG15_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TRIGOUT_Bits.TRIG15 */
#define IFX_GTM_TRIGOUT_TRIG15_OFF (30u)

/** \brief Length for Ifx_GTM_INTOUT_Bits.INT0 */
#define IFX_GTM_INTOUT_INT0_LEN (2u)

/** \brief Mask for Ifx_GTM_INTOUT_Bits.INT0 */
#define IFX_GTM_INTOUT_INT0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_INTOUT_Bits.INT0 */
#define IFX_GTM_INTOUT_INT0_OFF (0u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL0 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL0_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL0 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL0_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL0 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL1 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL1_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL1 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL1_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL1 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL1_OFF (4u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL2 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL2_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL2 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL2_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL2 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL2_OFF (8u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL3 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL3_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL3 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL3_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL3 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL3_OFF (12u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL4 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL4_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL4 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL4_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL4 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL4_OFF (16u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL5 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL5_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL5 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL5_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL5 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL5_OFF (20u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL6 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL6_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL6 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL6_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL6 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL6_OFF (24u)

/** \brief Length for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL7 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL7_LEN (4u)

/** \brief Mask for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL7 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL7_MSK (0xfu)

/** \brief Offset for Ifx_GTM_MCSTRIGOUTSEL_Bits.SEL7 */
#define IFX_GTM_MCSTRIGOUTSEL_SEL7_OFF (28u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS00 */
#define IFX_GTM_MCSINTSTAT_MCS00_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS00 */
#define IFX_GTM_MCSINTSTAT_MCS00_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS00 */
#define IFX_GTM_MCSINTSTAT_MCS00_OFF (0u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS10 */
#define IFX_GTM_MCSINTSTAT_MCS10_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS10 */
#define IFX_GTM_MCSINTSTAT_MCS10_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS10 */
#define IFX_GTM_MCSINTSTAT_MCS10_OFF (1u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS20 */
#define IFX_GTM_MCSINTSTAT_MCS20_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS20 */
#define IFX_GTM_MCSINTSTAT_MCS20_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS20 */
#define IFX_GTM_MCSINTSTAT_MCS20_OFF (2u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS30 */
#define IFX_GTM_MCSINTSTAT_MCS30_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS30 */
#define IFX_GTM_MCSINTSTAT_MCS30_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS30 */
#define IFX_GTM_MCSINTSTAT_MCS30_OFF (3u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS40 */
#define IFX_GTM_MCSINTSTAT_MCS40_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS40 */
#define IFX_GTM_MCSINTSTAT_MCS40_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS40 */
#define IFX_GTM_MCSINTSTAT_MCS40_OFF (4u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS50 */
#define IFX_GTM_MCSINTSTAT_MCS50_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS50 */
#define IFX_GTM_MCSINTSTAT_MCS50_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS50 */
#define IFX_GTM_MCSINTSTAT_MCS50_OFF (5u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS60 */
#define IFX_GTM_MCSINTSTAT_MCS60_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS60 */
#define IFX_GTM_MCSINTSTAT_MCS60_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS60 */
#define IFX_GTM_MCSINTSTAT_MCS60_OFF (6u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS70 */
#define IFX_GTM_MCSINTSTAT_MCS70_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS70 */
#define IFX_GTM_MCSINTSTAT_MCS70_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS70 */
#define IFX_GTM_MCSINTSTAT_MCS70_OFF (7u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS80 */
#define IFX_GTM_MCSINTSTAT_MCS80_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS80 */
#define IFX_GTM_MCSINTSTAT_MCS80_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS80 */
#define IFX_GTM_MCSINTSTAT_MCS80_OFF (8u)

/** \brief Length for Ifx_GTM_MCSINTSTAT_Bits.MCS90 */
#define IFX_GTM_MCSINTSTAT_MCS90_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS90 */
#define IFX_GTM_MCSINTSTAT_MCS90_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS90 */
#define IFX_GTM_MCSINTSTAT_MCS90_OFF (9u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS0 */
#define IFX_GTM_MCSINTCLR_MCS0_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS0 */
#define IFX_GTM_MCSINTCLR_MCS0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS0 */
#define IFX_GTM_MCSINTCLR_MCS0_OFF (0u)

