zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_MCSINTCLR_MCS1_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_MCSINTCLR_MCS1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS1 */
#define IFX_GTM_MCSINTCLR_MCS1_OFF (1u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_MCSINTCLR_MCS2_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_MCSINTCLR_MCS2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS2 */
#define IFX_GTM_MCSINTCLR_MCS2_OFF (2u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS3 */
#define IFX_GTM_MCSINTCLR_MCS3_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS3 */
#define IFX_GTM_MCSINTCLR_MCS3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS3 */
#define IFX_GTM_MCSINTCLR_MCS3_OFF (3u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS4 */
#define IFX_GTM_MCSINTCLR_MCS4_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS4 */
#define IFX_GTM_MCSINTCLR_MCS4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS4 */
#define IFX_GTM_MCSINTCLR_MCS4_OFF (4u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS5 */
#define IFX_GTM_MCSINTCLR_MCS5_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS5 */
#define IFX_GTM_MCSINTCLR_MCS5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS5 */
#define IFX_GTM_MCSINTCLR_MCS5_OFF (5u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS6 */
#define IFX_GTM_MCSINTCLR_MCS6_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS6 */
#define IFX_GTM_MCSINTCLR_MCS6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS6 */
#define IFX_GTM_MCSINTCLR_MCS6_OFF (6u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS7 */
#define IFX_GTM_MCSINTCLR_MCS7_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS7 */
#define IFX_GTM_MCSINTCLR_MCS7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS7 */
#define IFX_GTM_MCSINTCLR_MCS7_OFF (7u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS8 */
#define IFX_GTM_MCSINTCLR_MCS8_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS8 */
#define IFX_GTM_MCSINTCLR_MCS8_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS8 */
#define IFX_GTM_MCSINTCLR_MCS8_OFF (8u)

/** \brief Length for Ifx_GTM_MCSINTCLR_Bits.MCS9 */
#define IFX_GTM_MCSINTCLR_MCS9_LEN (1u)

/** \brief Mask for Ifx_GTM_MCSINTCLR_Bits.MCS9 */
#define IFX_GTM_MCSINTCLR_MCS9_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCSINTCLR_Bits.MCS9 */
#define IFX_GTM_MCSINTCLR_MCS9_OFF (9u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN0 */
#define IFX_GTM_DXINCON_IN0_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN0 */
#define IFX_GTM_DXINCON_IN0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN0 */
#define IFX_GTM_DXINCON_IN0_OFF (0u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN1 */
#define IFX_GTM_DXINCON_IN1_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN1 */
#define IFX_GTM_DXINCON_IN1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN1 */
#define IFX_GTM_DXINCON_IN1_OFF (1u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN2 */
#define IFX_GTM_DXINCON_IN2_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN2 */
#define IFX_GTM_DXINCON_IN2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN2 */
#define IFX_GTM_DXINCON_IN2_OFF (2u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN3 */
#define IFX_GTM_DXINCON_IN3_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN3 */
#define IFX_GTM_DXINCON_IN3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN3 */
#define IFX_GTM_DXINCON_IN3_OFF (3u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN4 */
#define IFX_GTM_DXINCON_IN4_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN4 */
#define IFX_GTM_DXINCON_IN4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN4 */
#define IFX_GTM_DXINCON_IN4_OFF (4u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN5 */
#define IFX_GTM_DXINCON_IN5_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN5 */
#define IFX_GTM_DXINCON_IN5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN5 */
#define IFX_GTM_DXINCON_IN5_OFF (5u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN6 */
#define IFX_GTM_DXINCON_IN6_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN6 */
#define IFX_GTM_DXINCON_IN6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN6 */
#define IFX_GTM_DXINCON_IN6_OFF (6u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN7 */
#define IFX_GTM_DXINCON_IN7_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN7 */
#define IFX_GTM_DXINCON_IN7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN7 */
#define IFX_GTM_DXINCON_IN7_OFF (7u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN8 */
#define IFX_GTM_DXINCON_IN8_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN8 */
#define IFX_GTM_DXINCON_IN8_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN8 */
#define IFX_GTM_DXINCON_IN8_OFF (8u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.IN9 */
#define IFX_GTM_DXINCON_IN9_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.IN9 */
#define IFX_GTM_DXINCON_IN9_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.IN9 */
#define IFX_GTM_DXINCON_IN9_OFF (9u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS0 */
#define IFX_GTM_DXINCON_DSS0_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS0 */
#define IFX_GTM_DXINCON_DSS0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS0 */
#define IFX_GTM_DXINCON_DSS0_OFF (16u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS1 */
#define IFX_GTM_DXINCON_DSS1_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS1 */
#define IFX_GTM_DXINCON_DSS1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS1 */
#define IFX_GTM_DXINCON_DSS1_OFF (17u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS2 */
#define IFX_GTM_DXINCON_DSS2_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS2 */
#define IFX_GTM_DXINCON_DSS2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS2 */
#define IFX_GTM_DXINCON_DSS2_OFF (18u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS3 */
#define IFX_GTM_DXINCON_DSS3_LEN (1u)

