zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS3 */
#define IFX_GTM_DXINCON_DSS3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS3 */
#define IFX_GTM_DXINCON_DSS3_OFF (19u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS4 */
#define IFX_GTM_DXINCON_DSS4_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS4 */
#define IFX_GTM_DXINCON_DSS4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS4 */
#define IFX_GTM_DXINCON_DSS4_OFF (20u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS5 */
#define IFX_GTM_DXINCON_DSS5_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS5 */
#define IFX_GTM_DXINCON_DSS5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS5 */
#define IFX_GTM_DXINCON_DSS5_OFF (21u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS6 */
#define IFX_GTM_DXINCON_DSS6_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS6 */
#define IFX_GTM_DXINCON_DSS6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS6 */
#define IFX_GTM_DXINCON_DSS6_OFF (22u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS7 */
#define IFX_GTM_DXINCON_DSS7_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS7 */
#define IFX_GTM_DXINCON_DSS7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS7 */
#define IFX_GTM_DXINCON_DSS7_OFF (23u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS8 */
#define IFX_GTM_DXINCON_DSS8_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS8 */
#define IFX_GTM_DXINCON_DSS8_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS8 */
#define IFX_GTM_DXINCON_DSS8_OFF (24u)

/** \brief Length for Ifx_GTM_DXINCON_Bits.DSS9 */
#define IFX_GTM_DXINCON_DSS9_LEN (1u)

/** \brief Mask for Ifx_GTM_DXINCON_Bits.DSS9 */
#define IFX_GTM_DXINCON_DSS9_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DXINCON_Bits.DSS9 */
#define IFX_GTM_DXINCON_DSS9_OFF (25u)

/** \brief Length for Ifx_GTM_DATAIN_Bits.DATA */
#define IFX_GTM_DATAIN_DATA_LEN (32u)

/** \brief Mask for Ifx_GTM_DATAIN_Bits.DATA */
#define IFX_GTM_DATAIN_DATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_GTM_DATAIN_Bits.DATA */
#define IFX_GTM_DATAIN_DATA_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_SET_CON3_Bits.SEL12 */
#define IFX_GTM_MSC_SET_CON3_SEL12_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON3_Bits.SEL12 */
#define IFX_GTM_MSC_SET_CON3_SEL12_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON3_Bits.SEL12 */
#define IFX_GTM_MSC_SET_CON3_SEL12_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_SET_CON3_Bits.SEL13 */
#define IFX_GTM_MSC_SET_CON3_SEL13_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON3_Bits.SEL13 */
#define IFX_GTM_MSC_SET_CON3_SEL13_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON3_Bits.SEL13 */
#define IFX_GTM_MSC_SET_CON3_SEL13_OFF (8u)

/** \brief Length for Ifx_GTM_MSC_SET_CON3_Bits.SEL14 */
#define IFX_GTM_MSC_SET_CON3_SEL14_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON3_Bits.SEL14 */
#define IFX_GTM_MSC_SET_CON3_SEL14_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON3_Bits.SEL14 */
#define IFX_GTM_MSC_SET_CON3_SEL14_OFF (16u)

/** \brief Length for Ifx_GTM_MSC_SET_CON3_Bits.SEL15 */
#define IFX_GTM_MSC_SET_CON3_SEL15_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON3_Bits.SEL15 */
#define IFX_GTM_MSC_SET_CON3_SEL15_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON3_Bits.SEL15 */
#define IFX_GTM_MSC_SET_CON3_SEL15_OFF (24u)

/** \brief Length for Ifx_GTM_MSC_SET_CON0_Bits.SEL0 */
#define IFX_GTM_MSC_SET_CON0_SEL0_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON0_Bits.SEL0 */
#define IFX_GTM_MSC_SET_CON0_SEL0_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON0_Bits.SEL0 */
#define IFX_GTM_MSC_SET_CON0_SEL0_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_SET_CON0_Bits.SEL1 */
#define IFX_GTM_MSC_SET_CON0_SEL1_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON0_Bits.SEL1 */
#define IFX_GTM_MSC_SET_CON0_SEL1_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON0_Bits.SEL1 */
#define IFX_GTM_MSC_SET_CON0_SEL1_OFF (8u)

/** \brief Length for Ifx_GTM_MSC_SET_CON0_Bits.SEL2 */
#define IFX_GTM_MSC_SET_CON0_SEL2_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON0_Bits.SEL2 */
#define IFX_GTM_MSC_SET_CON0_SEL2_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON0_Bits.SEL2 */
#define IFX_GTM_MSC_SET_CON0_SEL2_OFF (16u)

/** \brief Length for Ifx_GTM_MSC_SET_CON0_Bits.SEL3 */
#define IFX_GTM_MSC_SET_CON0_SEL3_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON0_Bits.SEL3 */
#define IFX_GTM_MSC_SET_CON0_SEL3_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON0_Bits.SEL3 */
#define IFX_GTM_MSC_SET_CON0_SEL3_OFF (24u)

/** \brief Length for Ifx_GTM_MSC_SET_CON2_Bits.SEL8 */
#define IFX_GTM_MSC_SET_CON2_SEL8_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON2_Bits.SEL8 */
#define IFX_GTM_MSC_SET_CON2_SEL8_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON2_Bits.SEL8 */
#define IFX_GTM_MSC_SET_CON2_SEL8_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_SET_CON2_Bits.SEL9 */
#define IFX_GTM_MSC_SET_CON2_SEL9_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON2_Bits.SEL9 */
#define IFX_GTM_MSC_SET_CON2_SEL9_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON2_Bits.SEL9 */
#define IFX_GTM_MSC_SET_CON2_SEL9_OFF (8u)

/** \brief Length for Ifx_GTM_MSC_SET_CON2_Bits.SEL10 */
#define IFX_GTM_MSC_SET_CON2_SEL10_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON2_Bits.SEL10 */
#define IFX_GTM_MSC_SET_CON2_SEL10_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON2_Bits.SEL10 */
#define IFX_GTM_MSC_SET_CON2_SEL10_OFF (16u)

/** \brief Length for Ifx_GTM_MSC_SET_CON2_Bits.SEL11 */
#define IFX_GTM_MSC_SET_CON2_SEL11_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON2_Bits.SEL11 */
#define IFX_GTM_MSC_SET_CON2_SEL11_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON2_Bits.SEL11 */
#define IFX_GTM_MSC_SET_CON2_SEL11_OFF (24u)

/** \brief Length for Ifx_GTM_MSC_SET_CON1_Bits.SEL4 */
#define IFX_GTM_MSC_SET_CON1_SEL4_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON1_Bits.SEL4 */
#define IFX_GTM_MSC_SET_CON1_SEL4_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON1_Bits.SEL4 */
#define IFX_GTM_MSC_SET_CON1_SEL4_OFF (0u)

/** \brief Length for Ifx_GTM_MSC_SET_CON1_Bits.SEL5 */
#define IFX_GTM_MSC_SET_CON1_SEL5_LEN (5u)

/** \brief Mask for Ifx_GTM_MSC_SET_CON1_Bits.SEL5 */
#define IFX_GTM_MSC_SET_CON1_SEL5_MSK (0x1fu)

/** \brief Offset for Ifx_GTM_MSC_SET_CON1_Bits.SEL5 */
#define IFX_GTM_MSC_SET_CON1_SEL5_OFF (8u)

