zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ATOM_AGC_INT_TRIG_Bits.INT_TRIG7 */
#define IFX_GTM_ATOM_AGC_INT_TRIG_INT_TRIG7_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_AGC_INT_TRIG_Bits.INT_TRIG7 */
#define IFX_GTM_ATOM_AGC_INT_TRIG_INT_TRIG7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ATOM_AGC_INT_TRIG_Bits.INT_TRIG7 */
#define IFX_GTM_ATOM_AGC_INT_TRIG_INT_TRIG7_OFF (14u)

/** \brief Length for Ifx_GTM_MCS_CH_R_Bits.DATA */
#define IFX_GTM_MCS_CH_R_DATA_LEN (24u)

/** \brief Mask for Ifx_GTM_MCS_CH_R_Bits.DATA */
#define IFX_GTM_MCS_CH_R_DATA_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_MCS_CH_R_Bits.DATA */
#define IFX_GTM_MCS_CH_R_DATA_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRL_Bits.EN */
#define IFX_GTM_MCS_CH_CTRL_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRL_Bits.EN */
#define IFX_GTM_MCS_CH_CTRL_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRL_Bits.EN */
#define IFX_GTM_MCS_CH_CTRL_EN_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRL_Bits.IRQ */
#define IFX_GTM_MCS_CH_CTRL_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRL_Bits.IRQ */
#define IFX_GTM_MCS_CH_CTRL_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRL_Bits.IRQ */
#define IFX_GTM_MCS_CH_CTRL_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRL_Bits.ERR */
#define IFX_GTM_MCS_CH_CTRL_ERR_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRL_Bits.ERR */
#define IFX_GTM_MCS_CH_CTRL_ERR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRL_Bits.ERR */
#define IFX_GTM_MCS_CH_CTRL_ERR_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRL_Bits.CY */
#define IFX_GTM_MCS_CH_CTRL_CY_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRL_Bits.CY */
#define IFX_GTM_MCS_CH_CTRL_CY_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRL_Bits.CY */
#define IFX_GTM_MCS_CH_CTRL_CY_OFF (4u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRL_Bits.Z */
#define IFX_GTM_MCS_CH_CTRL_Z_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRL_Bits.Z */
#define IFX_GTM_MCS_CH_CTRL_Z_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRL_Bits.Z */
#define IFX_GTM_MCS_CH_CTRL_Z_OFF (5u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRL_Bits.V */
#define IFX_GTM_MCS_CH_CTRL_V_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRL_Bits.V */
#define IFX_GTM_MCS_CH_CTRL_V_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRL_Bits.V */
#define IFX_GTM_MCS_CH_CTRL_V_OFF (6u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRL_Bits.N */
#define IFX_GTM_MCS_CH_CTRL_N_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRL_Bits.N */
#define IFX_GTM_MCS_CH_CTRL_N_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRL_Bits.N */
#define IFX_GTM_MCS_CH_CTRL_N_OFF (7u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRL_Bits.CAT */
#define IFX_GTM_MCS_CH_CTRL_CAT_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRL_Bits.CAT */
#define IFX_GTM_MCS_CH_CTRL_CAT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRL_Bits.CAT */
#define IFX_GTM_MCS_CH_CTRL_CAT_OFF (8u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRL_Bits.CWT */
#define IFX_GTM_MCS_CH_CTRL_CWT_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRL_Bits.CWT */
#define IFX_GTM_MCS_CH_CTRL_CWT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRL_Bits.CWT */
#define IFX_GTM_MCS_CH_CTRL_CWT_OFF (9u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRL_Bits.SAT */
#define IFX_GTM_MCS_CH_CTRL_SAT_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRL_Bits.SAT */
#define IFX_GTM_MCS_CH_CTRL_SAT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRL_Bits.SAT */
#define IFX_GTM_MCS_CH_CTRL_SAT_OFF (10u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRL_Bits.SP_CNT */
#define IFX_GTM_MCS_CH_CTRL_SP_CNT_LEN (3u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRL_Bits.SP_CNT */
#define IFX_GTM_MCS_CH_CTRL_SP_CNT_MSK (0x7u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRL_Bits.SP_CNT */
#define IFX_GTM_MCS_CH_CTRL_SP_CNT_OFF (16u)

/** \brief Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB0 */
#define IFX_GTM_MCS_CH_ACB_ACB0_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB0 */
#define IFX_GTM_MCS_CH_ACB_ACB0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB0 */
#define IFX_GTM_MCS_CH_ACB_ACB0_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB1 */
#define IFX_GTM_MCS_CH_ACB_ACB1_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB1 */
#define IFX_GTM_MCS_CH_ACB_ACB1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB1 */
#define IFX_GTM_MCS_CH_ACB_ACB1_OFF (1u)

/** \brief Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB2 */
#define IFX_GTM_MCS_CH_ACB_ACB2_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB2 */
#define IFX_GTM_MCS_CH_ACB_ACB2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB2 */
#define IFX_GTM_MCS_CH_ACB_ACB2_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB3 */
#define IFX_GTM_MCS_CH_ACB_ACB3_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB3 */
#define IFX_GTM_MCS_CH_ACB_ACB3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB3 */
#define IFX_GTM_MCS_CH_ACB_ACB3_OFF (3u)

/** \brief Length for Ifx_GTM_MCS_CH_ACB_Bits.ACB4 */
#define IFX_GTM_MCS_CH_ACB_ACB4_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_ACB_Bits.ACB4 */
#define IFX_GTM_MCS_CH_ACB_ACB4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_ACB_Bits.ACB4 */
#define IFX_GTM_MCS_CH_ACB_ACB4_OFF (4u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH_CTRG_TRG0_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH_CTRG_TRG0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG0 */
#define IFX_GTM_MCS_CH_CTRG_TRG0_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH_CTRG_TRG1_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH_CTRG_TRG1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG1 */
#define IFX_GTM_MCS_CH_CTRG_TRG1_OFF (1u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH_CTRG_TRG2_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH_CTRG_TRG2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG2 */
#define IFX_GTM_MCS_CH_CTRG_TRG2_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH_CTRG_TRG3_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH_CTRG_TRG3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG3 */
#define IFX_GTM_MCS_CH_CTRG_TRG3_OFF (3u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH_CTRG_TRG4_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH_CTRG_TRG4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG4 */
#define IFX_GTM_MCS_CH_CTRG_TRG4_OFF (4u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH_CTRG_TRG5_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH_CTRG_TRG5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG5 */
#define IFX_GTM_MCS_CH_CTRG_TRG5_OFF (5u)

/** \brief Length for Ifx_GTM_MCS_CH_CTRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH_CTRG_TRG6_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_CTRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH_CTRG_TRG6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_CTRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH_CTRG_TRG6_OFF (6u)

