zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.HLT_SP_OFL */
#define IFX_GTM_MCS_CTRL_STAT_HLT_SP_OFL_OFF (17u)

/** \brief Length for Ifx_GTM_MCS_CTRL_STAT_Bits.ERR_SRC_ID */
#define IFX_GTM_MCS_CTRL_STAT_ERR_SRC_ID_LEN (3u)

/** \brief Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.ERR_SRC_ID */
#define IFX_GTM_MCS_CTRL_STAT_ERR_SRC_ID_MSK (0x7u)

/** \brief Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.ERR_SRC_ID */
#define IFX_GTM_MCS_CTRL_STAT_ERR_SRC_ID_OFF (20u)

/** \brief Length for Ifx_GTM_MCS_CTRL_STAT_Bits.EN_TIM_FOUT */
#define IFX_GTM_MCS_CTRL_STAT_EN_TIM_FOUT_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.EN_TIM_FOUT */
#define IFX_GTM_MCS_CTRL_STAT_EN_TIM_FOUT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.EN_TIM_FOUT */
#define IFX_GTM_MCS_CTRL_STAT_EN_TIM_FOUT_OFF (24u)

/** \brief Length for Ifx_GTM_MCS_CTRL_STAT_Bits.EN_XOREG */
#define IFX_GTM_MCS_CTRL_STAT_EN_XOREG_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.EN_XOREG */
#define IFX_GTM_MCS_CTRL_STAT_EN_XOREG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.EN_XOREG */
#define IFX_GTM_MCS_CTRL_STAT_EN_XOREG_OFF (25u)

/** \brief Length for Ifx_GTM_MCS_CTRL_STAT_Bits.HLT_AEIM_ERR */
#define IFX_GTM_MCS_CTRL_STAT_HLT_AEIM_ERR_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CTRL_STAT_Bits.HLT_AEIM_ERR */
#define IFX_GTM_MCS_CTRL_STAT_HLT_AEIM_ERR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CTRL_STAT_Bits.HLT_AEIM_ERR */
#define IFX_GTM_MCS_CTRL_STAT_HLT_AEIM_ERR_OFF (26u)

/** \brief Length for Ifx_GTM_MCS_RESET_Bits.RST0 */
#define IFX_GTM_MCS_RESET_RST0_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_RESET_Bits.RST0 */
#define IFX_GTM_MCS_RESET_RST0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_RESET_Bits.RST0 */
#define IFX_GTM_MCS_RESET_RST0_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_RESET_Bits.RST1 */
#define IFX_GTM_MCS_RESET_RST1_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_RESET_Bits.RST1 */
#define IFX_GTM_MCS_RESET_RST1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_RESET_Bits.RST1 */
#define IFX_GTM_MCS_RESET_RST1_OFF (1u)

/** \brief Length for Ifx_GTM_MCS_RESET_Bits.RST2 */
#define IFX_GTM_MCS_RESET_RST2_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_RESET_Bits.RST2 */
#define IFX_GTM_MCS_RESET_RST2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_RESET_Bits.RST2 */
#define IFX_GTM_MCS_RESET_RST2_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_RESET_Bits.RST3 */
#define IFX_GTM_MCS_RESET_RST3_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_RESET_Bits.RST3 */
#define IFX_GTM_MCS_RESET_RST3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_RESET_Bits.RST3 */
#define IFX_GTM_MCS_RESET_RST3_OFF (3u)

/** \brief Length for Ifx_GTM_MCS_RESET_Bits.RST4 */
#define IFX_GTM_MCS_RESET_RST4_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_RESET_Bits.RST4 */
#define IFX_GTM_MCS_RESET_RST4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_RESET_Bits.RST4 */
#define IFX_GTM_MCS_RESET_RST4_OFF (4u)

/** \brief Length for Ifx_GTM_MCS_RESET_Bits.RST5 */
#define IFX_GTM_MCS_RESET_RST5_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_RESET_Bits.RST5 */
#define IFX_GTM_MCS_RESET_RST5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_RESET_Bits.RST5 */
#define IFX_GTM_MCS_RESET_RST5_OFF (5u)

/** \brief Length for Ifx_GTM_MCS_RESET_Bits.RST6 */
#define IFX_GTM_MCS_RESET_RST6_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_RESET_Bits.RST6 */
#define IFX_GTM_MCS_RESET_RST6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_RESET_Bits.RST6 */
#define IFX_GTM_MCS_RESET_RST6_OFF (6u)

/** \brief Length for Ifx_GTM_MCS_RESET_Bits.RST7 */
#define IFX_GTM_MCS_RESET_RST7_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_RESET_Bits.RST7 */
#define IFX_GTM_MCS_RESET_RST7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_RESET_Bits.RST7 */
#define IFX_GTM_MCS_RESET_RST7_OFF (7u)

/** \brief Length for Ifx_GTM_MCS_CAT_Bits.CAT0 */
#define IFX_GTM_MCS_CAT_CAT0_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CAT_Bits.CAT0 */
#define IFX_GTM_MCS_CAT_CAT0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CAT_Bits.CAT0 */
#define IFX_GTM_MCS_CAT_CAT0_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CAT_Bits.CAT1 */
#define IFX_GTM_MCS_CAT_CAT1_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CAT_Bits.CAT1 */
#define IFX_GTM_MCS_CAT_CAT1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CAT_Bits.CAT1 */
#define IFX_GTM_MCS_CAT_CAT1_OFF (1u)

/** \brief Length for Ifx_GTM_MCS_CAT_Bits.CAT2 */
#define IFX_GTM_MCS_CAT_CAT2_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CAT_Bits.CAT2 */
#define IFX_GTM_MCS_CAT_CAT2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CAT_Bits.CAT2 */
#define IFX_GTM_MCS_CAT_CAT2_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_CAT_Bits.CAT3 */
#define IFX_GTM_MCS_CAT_CAT3_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CAT_Bits.CAT3 */
#define IFX_GTM_MCS_CAT_CAT3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CAT_Bits.CAT3 */
#define IFX_GTM_MCS_CAT_CAT3_OFF (3u)

/** \brief Length for Ifx_GTM_MCS_CAT_Bits.CAT4 */
#define IFX_GTM_MCS_CAT_CAT4_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CAT_Bits.CAT4 */
#define IFX_GTM_MCS_CAT_CAT4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CAT_Bits.CAT4 */
#define IFX_GTM_MCS_CAT_CAT4_OFF (4u)

/** \brief Length for Ifx_GTM_MCS_CAT_Bits.CAT5 */
#define IFX_GTM_MCS_CAT_CAT5_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CAT_Bits.CAT5 */
#define IFX_GTM_MCS_CAT_CAT5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CAT_Bits.CAT5 */
#define IFX_GTM_MCS_CAT_CAT5_OFF (5u)

/** \brief Length for Ifx_GTM_MCS_CAT_Bits.CAT6 */
#define IFX_GTM_MCS_CAT_CAT6_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CAT_Bits.CAT6 */
#define IFX_GTM_MCS_CAT_CAT6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CAT_Bits.CAT6 */
#define IFX_GTM_MCS_CAT_CAT6_OFF (6u)

/** \brief Length for Ifx_GTM_MCS_CAT_Bits.CAT7 */
#define IFX_GTM_MCS_CAT_CAT7_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CAT_Bits.CAT7 */
#define IFX_GTM_MCS_CAT_CAT7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CAT_Bits.CAT7 */
#define IFX_GTM_MCS_CAT_CAT7_OFF (7u)

/** \brief Length for Ifx_GTM_MCS_CWT_Bits.CWT0 */
#define IFX_GTM_MCS_CWT_CWT0_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CWT_Bits.CWT0 */
#define IFX_GTM_MCS_CWT_CWT0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CWT_Bits.CWT0 */
#define IFX_GTM_MCS_CWT_CWT0_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CWT_Bits.CWT1 */
#define IFX_GTM_MCS_CWT_CWT1_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CWT_Bits.CWT1 */
#define IFX_GTM_MCS_CWT_CWT1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CWT_Bits.CWT1 */
#define IFX_GTM_MCS_CWT_CWT1_OFF (1u)

/** \brief Length for Ifx_GTM_MCS_CWT_Bits.CWT2 */
#define IFX_GTM_MCS_CWT_CWT2_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CWT_Bits.CWT2 */
#define IFX_GTM_MCS_CWT_CWT2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CWT_Bits.CWT2 */
#define IFX_GTM_MCS_CWT_CWT2_OFF (2u)

